# Домашнее задание по теме "Потоки на классах"
#
# Цель: научиться создавать классы наследованные от класса Thread.
#
# Задача "За честь и отвагу!":
# Создайте
# Пункты задачи:
# Создайте класс Knight с соответствующими описанию свойствами.
from threading import Thread
from time import sleep


class Knight(Thread):
    """
    Класс Knight, наследованный от Thread, объекты которого будут обладать следующими свойствами:
    Атрибут name - имя рыцаря. (str)
    Атрибут power - сила рыцаря. (int)
    """
    def __init__(self, name, power):
        super().__init__()
        self.name = name
        self.power = power

    def run(self):
        """
        Метод run, в котором рыцарь будет сражаться с врагами:
        При запуске потока должна выводится надпись "<Имя рыцаря>, на нас напали!".
        Рыцарь сражается до тех пор, пока не повергнет всех врагов (у всех потоков их 100).
        В процессе сражения количество врагов уменьшается на power текущего рыцаря.
        По прошествию 1 дня сражения (1 секунды) выводится строка "<Имя рыцаря> сражается <кол-во дней>...,
        осталось <кол-во воинов> воинов."
        После победы над всеми врагами выводится надпись "<Имя рыцаря> одержал победу спустя <кол-во дней> дней(дня)!"
        Как можно заметить нужно сделать задержку в 1 секунду, инструменты для задержки выберите сами.
        """
        number_of_enemy_faces = 100
        print(f'{self.name}, на нас напали!')
#        for i in range(0 ,number_of_enemy_faces, 10):
        i = 1
        while i < self.power and number_of_enemy_faces - i*self.power > 0:
            sleep(1)
            print(f'{self.name} сражается {i} день(дня) ...,'
                  f' осталось {number_of_enemy_faces - i*self.power} воинов супостата.')
            i += 1
        print(f'"{self.name} одержал победу спустя {i} дней(дня)!"')

# Создайте и запустите 2 потока на основе класса Knight.
#


first_knight = Knight('Sir Lancelot', 10)
first_knight.start()

second_knight = Knight("Sir Galahad", 20)
second_knight.start()

first_knight.join()
second_knight.join()

# Выведите на экран строку об окончании битв.

print(f'Все битвы закончились!')

# # Запуск потоков и остановка текущего
# # Вывод строки об окончании сражения
# Вывод на консоль:
# Sir Lancelot, на нас напали!
# Sir Lancelot, сражается 1 день(дня)..., осталось 90 воинов.
# Sir Galahad, на нас напали!
# Sir Galahad, сражается 1 день(дня)..., осталось 80 воинов.
# Sir Galahad, сражается 2 день(дня)..., осталось 60 воинов.
# Sir Lancelot, сражается 2 день(дня)..., осталось 80 воинов.
# Sir Lancelot, сражается 3 день(дня)..., осталось 70 воинов.
# Sir Galahad, сражается 3 день(дня)..., осталось 40 воинов.
# Sir Lancelot, сражается 4 день(дня)..., осталось 60 воинов.
# Sir Galahad, сражается 4 день(дня)..., осталось 20 воинов.
# Sir Galahad, сражается 5 день(дня)..., осталось 0 воинов.
# Sir Lancelot, сражается 5 день(дня)..., осталось 50 воинов.
# Sir Lancelot, сражается 6 день(дня)..., осталось 40 воинов.
# Sir Galahad одержал победу спустя 5 дней(дня)!
# Sir Lancelot, сражается 7 день(дня)..., осталось 30 воинов.
# Sir Lancelot, сражается 8 день(дня)..., осталось 20 воинов.
# Sir Lancelot, сражается 9 день(дня)..., осталось 10 воинов.
# Sir Lancelot, сражается 10 день(дня)..., осталось 0 воинов.
# Sir Lancelot одержал победу спустя 10 дней(дня)!
# Все битвы закончились!
#
# Файл module_10_2.py и загрузите его на ваш GitHub репозиторий. В решении пришлите ссылку на него.
