# Домашнее задание по теме "Асинхронность на практике"
# Цель: приобрести навык использования асинхронного запуска функций на практике
#
# Задача "Асинхронные силачи":
# Необходимо сделать имитацию соревнований по поднятию шаров Атласа.
import asyncio


async def start_strongman(name, power):
    """
    Напишите асинхронную функцию start_strongman(name, power).
    Реализуйте следующую логику в функции:
    В начале работы должна выводиться строка - 'Силач <имя силача> начал соревнования.'
    После должна выводиться строка - 'Силач <имя силача> поднял <номер шара>' с задержкой обратно пропорциональной его
    силе power. Для каждого участника количество шаров одинаковое - 5.
    В конце поднятия всех шаров должна выводится строка 'Силач <имя силача> закончил соревнования.'
    :param name: имя силача
    :param power: подъёмная мощность
    :return:
    """

    print(f'Силач {name} начал соревнования.')
    for ball_number in range(1, 6):
        await asyncio.sleep(1/power)
        print(f'Силач {name} поднял шар № {ball_number}')

    print(f'Силач {name} закончил соревнования.')


async def start_tournament():
    """
    Также напишите асинхронную функцию start_tournament, в которой создаются 3 задачи для функций start_strongman.
    :return:
    """
    start_strongman_1 = asyncio.create_task(start_strongman('Pasha', 3))
    start_strongman_2 = asyncio.create_task(start_strongman('Denis', 4))
    start_strongman_3 = asyncio.create_task(start_strongman('Apollon', 5))

    await start_strongman_1
    await start_strongman_2
    await start_strongman_3

# Имена(name) и силу(power) для вызовов функции start_strongman можете выбрать самостоятельно.
# После поставьте каждую задачу в ожидание (await).
# Запустите асинхронную функцию start_tournament методом run.
#
# Пример результата выполнения программы:
# Переданные аргументы в функции start_strongman:
# start_strongman('Pasha', 3)
asyncio.run(start_tournament())


# 'Denis', 4
# 'Apollon', 5
# Вывод на консоль:
# Силач Pasha начал соревнования
# Силач Denis начал соревнования
# Силач Apollon начал соревнования
# Силач Apollon поднял 1 шар
# Силач Denis поднял 1 шар
# Силач Pasha поднял 1 шар
# Силач Apollon поднял 2 шар
# Силач Denis поднял 2 шар
# Силач Apollon поднял 3 шар
# Силач Pasha поднял 2 шар
# Силач Denis поднял 3 шар
# Силач Apollon поднял 4 шар
# Силач Pasha поднял 3 шар
# Силач Apollon поднял 5 шар
# Силач Apollon закончил соревнования
# Силач Denis поднял 4 шар
# Силач Denis поднял 5 шар
# Силач Denis закончил соревнования
# Силач Pasha поднял 4 шар
# Силач Pasha поднял 5 шар
# Силач Pasha закончил соревнования
# Примечания:
# Для обозначения асинхронной функции используйте оператор async.
# Для постановки задачи в режим ожидания используйте оператор await.
# Для задержки в асинхронной функции используйте функцию sleep из пакета asyncio.
# Для запуска асинхронной функции используйте функцию run из пакета asyncio.
# Файл module_13_1.py загрузите на ваш GitHub репозиторий. В решении пришлите ссылку на него.
